# Задача 26:  Напишите программу, которая на вход принимает два числа A и B,
# и возводит число А в целую степень B с помощью рекурсии.
# *Пример:*
# A = 3; B = 5 -> 243 (3⁵)
# A = 2; B = 3 -> 8 
def task_1():
    print('Задача 26')
    def rise(А, B):
        if(B == 1):
            return A
        if(B != 1):
            return (A * rise(A, B - 1))
    A = int(input('Введите число А '))
    B = int(input('Введите число В '))
    print(f'A = {A}; B = {B}; -> {rise(A, B)}')

# Задача 28: Напишите рекурсивную функцию sum(a, b), возвращающую сумму двух целых неотрицательных чисел.
# Из всех арифметических операций допускаются только +1 и -1. Также нельзя использовать циклы.
# *Пример:*
# 2 2
# 4 

def task_2():

    print('Задача 28')
    def sum(a, b):
        if (b != 0):
            return (sum(a , b - 1) + 1 )
        if (b == 0):
            return a
    a = int(input('Введите число a '))
    b = int(input('Введите число b '))
    print(f'a = {a}; b = {b}; -> {sum(a, b)}')


def main():
    task_1()
    task_2()


if __name__ == '__main__':
    main()
